# initial seed file - test templates one and two
[
{
"template_name":"compliance testing",
"question":"1. Has the census been received?",
"yes_text":"Census received",
"no_text":"Census missing. Plan is/will be placed on hold.",
"not_applicable_text":"A census must be provided. Not applicable is not an appropriate response.",
"category":"CENSUS",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"If the census is missing, e-mail the relationship manager immediately prepare the folders and pull any reporting such as trust statements and start the trust reconciliation. Once you have gotten as far as possible, place the plan on hold.",
}
{
"template_name":"compliance testing",
"question":"2. Has the questionnaire been received?",
"yes_text":"Questionnaire received.",
"no_text":"Questionnaire not received. Request. If the client appears to answer the same way each year move forward and ask the client to send a Questionnaire, confirm results.",
"not_applicable_text":"A Questionnaire should be provided. If the client appears to answer the same way each year move forward and ask the client to send a Questionnaire, confirm results.",
"category":"QUESTIONNAIRE",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"If the questionnaire is missing, prepare as much of the testing as possible based on assumptions inherited from the prior year, using either the system. E-mail the relationship manager: I am proceeding based on last year's questionnaire. That said I cannot release the results until I have received the questionnaire for the current year."
},
{
"template_name":"compliance testing",
"question":"3. Is the census formatted in a format that can be directly loaded into the system?",
"yes_text":"Census is in a format ready for load.",
"no_text":"Census must be formatted before it can be loaded.",
"not_applicable_text":"An invalid response for whether the census was formatted correctly was entered. Choose either Y or N.",
"category":"CENSUS",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"If the census has critical errors that prevent you from loading it into the system, let the relationship manager know. Some sample language: The census does not have social security numbers. The census is missing compensation for some employees. The census is missing compensation for all employees. The census is missing hours for some employees and the plan requires hours to calculate eligibility/allocate a contribution.":},
{
"template_name":"compliance testing",
"question":"4. Has the census been loaded to the system?",
"yes_text":"Census loaded.",
"no_text":"Census needs to be loaded.",
"not_applicable_text":"An invalid response for whether the census was loaded was entered.  Choose either Y or N.",
"category":"CENSUS",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Make sure to load the census into the system and perform all necessary data checks within the system and forward all questions to the relationship manager. Review against the Eligibility Proof."
},
{
"template_name":"compliance testing",
"question":"5. Has an Eligibility proof been prepared from the census that separates employees into the categories HCEs, NHCEs, Ineligibles(with explanation such as age,service), Excluded, Prior Year Terms?",
"yes_text":"Eligibility Proof employee classifications have been made.",
"no_text":"Eligibility Proof employee classifications need to be made.",
"not_applicable_text":"An invalid response for the Eligibility Proof employee classification step was entered. Choose either Y or N.",
"category":"ELIGIBILITYPROOF",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Use the template for the eligibility proof to estimate the test results. Formulas are included in the proof."
},
{
"template_name":"compliance testing",
"question":"6. Does the proof indicate the HCEs percentages, relationships and attribution for all employees with the same name as owner-employees, those earning over $120,000 in a prior year?",
"yes_text":"Owner percentages, relationships for those with the same last name as the owners and other relatives, and persons making over $120,000 in the last year have been marked in the file.",
"no_text":"Update the file with owner percentages, mark family with a 1 in the family/spouse/lineal descendant area or potential family relationships with a Y or N and flag persons making over 120,000 in the prior year with a Y as needed.",
"not_applicable_text":"No valid response entered Enter Y, N or NA to indicate whether all owner percentages, relationships for those with the same last name as the owners and other relatives, and persons making over $120,000 in the last year have been marked in the file.",
"category":"HCE",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Enter the HCE percentages, relationships and attribution on the Eligibility proof. If you had to use prior year note that and add a request for confirmation to your questions."
},
{
"template_name":"compliance testing",
"question":"7. Does the proof indicate the estimated Actual Deferral Percentage and properly cap the deferrals and the compensation considered at the at the limit for the year tested?"),
"yes_text":"Preliminary ADP ACP Results have been calculated and compared to the reports generated by the system. Variances have been resolved.",
"no_text":"Preliminary ADP ACP Results have NOT been calculated and compared to the reports generated by the system. OR Variances have been resolved.",
"not_applicable_text":"This plan does not have deferrals or match. ADP ACP testing does not apply.",
"category":"ADP",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"The Eligibility Proof contains instructions on how to determine the HCEs using ownership and attribution, as well as compensation and to apply the Top Paid Group election as needed. Make sure you sort employees into their eligibility classifications such as HCE versus NHCE, ineligible and excluded. Also, make sure you apply the compensation and deferral limits and factor-out any catch-up contributions in calculating the parentage of compensation each person deferred and the average deferral percentage for the HCE and NHCE groups."
},
{
"template_name":"compliance testing",
"question":"8. Have you indicated whether the plan uses Prior Year Testing and confirmed that the system is correctly set-up for Prior Year Testing?",
"yes_text":"The Prior Year Testing numbers have been entered.",
"no_text":"Enter Prior Year Testing numbers in the system.",
"not_applicable_text":"The plan does not use prior year testing.",
"category":"PRIORYEAR",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"The plan document will tell you whether the plan uses Prior Year testing or not. Obtain the percentages you use from the prior year’s ADP and ACP testing. If the plan is using the prior year testing method for the first time, use 3%. Note that a plan could use prior year testing for one source and not the other and rarely, some groups may be using prior and others could be using current so a ‘location’ based testing method may need to be used to track the prior year percentages appropriately."
},
{
"template_name":"compliance testing",
"question":"9. Have you confirmed the formula for any Match and ensured it is entered in the testing system? Enter NA if the plan either does not have a match source or will not be funding a match this year.",
"yes_text":"Match formula confirmed and entered and results checked.",
"no_text":"Enter the match formula into the system after confirming it against the document/client questionnaire/prior practice. If using a prior formula, indicate in Results sent to client.",
"not_applicable_text":"The plan does not have a match source or is not funding the match this year.",
"category":"MATCH",
"primary_driver":true,
"resource_url":"https://www.youtube.com",
"help_text":"The match formula will be stated in the plan document. You should also notate this formula on the Eligibility proof and perform a manual check and do a common sense comparison to last year’s funding amount, especially if the plan is new to your testing system."
},
{
"template_name":"compliance testing",
"question":"10. Have you confirmed the formula for any Safe Harbor Match and ensured it is entered in the testing system?",
"yes_text":"Safe Harbor match formula confirmed and entered and results checked.",
"no_text":"The plan does not have a Safe Harbor match source or is not funding the match this year.",
"not_applicable_text":" No valid response entered. Please enter a Y,N or NA as to whether the plan uses a Safe Harbor match and you have entered the formula into the system and checked the calculation.",
"category":"SAFEHARBORMATCH",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"The Safe Harbor match formula will be stated in the plan document. You should also notate this formula on the Eligibility proof and perform a manual check and do a common sense comparison to last year’s funding amount, especially if the plan is new to your testing system. The most common formula is 100% to 3% and 50% to 5% of compensation and the Eligibility proof will explain how to confirm this. Note that sometimes there are "maybe":provisions for Safe Harbors. If a plan has a maybe provision noted in the plan document, you will need to have the annual amendment stating that the Safe Harbor will be funded to use this method to pass testing."
},
{
"template_name":"compliance testing",
"question":"11. Have you verified the Match if the plan requires calculation and is on an annual basis according to the plan document/adoption agreement?",
"yes_text":"Match basis has been checked and whether a calculation is required was verified.",
"no_text":"Match basis (annual or not) or whether a calculation is needed must be verified.",
"not_applicable_text":"There is no Match source or the match is not being funded this year.",
"category":"MATCH",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Verify the match by downloading the trust statement to csv format and using vlookup in a spreadsheet to find any differences in what was funded and what is being calculated when a plan’s adoption agreement states that the funding is on an annual basis. If the funding is not on an annual basis, simply verify that the funding did not exceed the formula. If there is a variance, check to confirm that the information is not funding that is from a prior year due to timing differences before checking with the client/creating a true-up file."
},
{
"template_name":"compliance testing",
"question":"12. If the plan is a sole proprietorship or partnership and has Schedule C or Schedule K income that is not passing through as W-2 income, has the owner/all partners signed participation agreements?",
"yes_text":"All participation agreements for participating employers signed.",
"no_text":"Participating agreements missing/amendment and filing required.",
"not_applicable_text":"Participation agreements do not apply to this plan.",
"category":"K1",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"The plan document and questionnaire will indicate of a plan is a sole proprietorship or partnership. Be aware that some sole proprietorships/partnerships use pass their income through as W-2 wages, in which case, it is not necessary to make adjustments for schedule C or K income. If a sole proprietor or partner is participating make sure they have signed any necessary participation agreements."
},
{
"template_name":"compliance testing",
"question":"13. Has the income for sole proprietors/partners been entered correctly based on either Draft or final Schedule C or K-1 documents? Search for Entity Type in the plan document/adoption agreement to identify if the plan is a sole proprietorship/partnership not taxed as a corporation." ),
"yes_text":"Schedule C or K income entered completely on file and draft or final schedules provided.",
"no_text":"Provide Schedule C or K income and draft or final schedules.",
"not_applicable_text":"The plan is not a sole proprietorship or a partnership. Therefore Schedule C or K income does not have to be provided.",
"category":"K1",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"If income is not available, the plan should be placed on hold until it become available."
},
{
"template_name":"compliance testing",
"question":"14. Did you load and generate the ADP and ACP Tests?",
"yes_text":"ADP ACP tests generated.",
"no_text":"Generate ADP ACP tests.",
"not_applicable_text":"The plan does not have deferrals/match.",
"category":"ADPACP",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"ADP tests would not be required if no deferrals were made or under most circumstances where a plan is a 403(b) plan. ACP tests would not be required if there was no match. Note that if a plan has a Safe Harbor match and a regular match and contributes to both, the regular match is subject to an ACP test."
},
{
"template_name":"compliance testing",
"question":"15. Do the ADP and ACP tests match your expectations on the proof or if not have you explained the differences and made the adjustments needed to tie out the system to the census?",
"yes_text":"ADP and ACP tests match expectations based on proof/prior testing review.",
"no_text":"ADP and ACP tests do not match expectations based on proof/prior testing review.",
"not_applicable_text":"The plan does not have deferrals/match.",
"category":"ADPACP",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"When the ADP and ACP tests do not match expectations, identify the amount off and see if one person matches that amount; if not export the test data including name and contribution with a unique identifier such as social security number that can be vlooked up against or join the names to create a unique identifier and perform a vlookup in both directions, if needed. Then, after the persons identified as dropped from the report or with numbers in error show up. Some possible tactics to determine why there is an issue: confirm eligibility, any classifications such as exclusions that may be inherited from the prior year but may have changed the current testing year, or the possibility that the person was rehired and came in immediately to the plan as a start. "
},
{
"template_name":"compliance testing",
"question":"16. Has all the income for employees been accounted for?",
"yes_text":"All employee income accounted for.",
"no_text":"Employee income appears to be missing. Contact client.",
"not_applicable_text":"Not a valid response. Enter Y or N as to whether all employee income is accounted for.",
"category":"INCOME",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"All income should be accounted for. If income has dropped, confirm that the income is not too high for the system to register it and that the system is properly handling Schedule C and K1 reductions. Generally a report can be printed to show how the system is reducing for Schedule C and K1 reductions."
},
{
"template_name":"compliance testing",
"question":"17. Did the client provide excluded compensation for the Match calculation?",
"yes_text":"Excluded Compensation was provided for the match.",
"no_text":"Excluded Compensation needed for the match. Contact client.",
"not_applicable_text":"There is no excluded compensation for the match or the match is not being funded or the plan does not have a match source.",
"category":"MATCH",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"If the client failed to provide excluded Match compensation add to your questions to client: Please provide the compensation which should be excluded from the match calculation according to your plan document. List the type of compensation."
},
{
"template_name":"compliance testing",
"question":"18. Have you checked for plan Match excesses if the plan Match is on an allocation or payroll period basis?",
"yes_text":"Match excess checked.",
"no_text":"Check for Match excesses.",
"not_applicable_text":"Match excesses do not need to be checked because there is no match or the plan match is now being calculated and has not been funded yet.",
"category":"MATCH",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Only register cases in which the client overfunded the match unless there is a significant variance. If there is a significant variance, check first whether the prior year’s match data may be being used for some or all of the people."
},
{
"template_name":"compliance testing",
"question":"19. Have you prepared the Match Contribution file for either the contribution/calculation or excesses?",
"yes_text":"The match file has been prepared.",
"no_text":"The Match file needs to be prepared.",
"not_applicable_text":"Not applicable. No match is being funded or the match funded is the same as that confirmed by the system.",
"category":"MATCH",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Prepare the Match Contribution file, indicating funded amounts and the difference to fund, if some funding has already been received."
},
{
"template_name":"compliance testing",
"question":"20. Did the client provide the formula and classes for the Profit Sharing or Nonelective calculation? Enter N if the client was undecided. Enter NA if no Profit Sharing source or contribution to be made.",
"yes_text":"The Profit Sharing/Nonelective formula was provided or is specified in the document.",
"no_text":"The Profit sharing/nonelective formula must be obtained from the plan sponsor.",
"not_applicable_text":"The Profit Sharing/nonelective formula is not needed because the source does not apply to this plan or the source will not be funded this year.",
"category":"PROFITSHARING",
"primary_driver":true,
"resource_url":"https://www.youtube.com",
"help_text":"If the client failed to provide the formula and classes, add to your questions to the client: I understand that you intend to fund a cross-tested Profit Sharing contribution to your employees this year. In order to create the allocation, I need you to update the file to include the classes(group) for each employee and a formula to apply, as well as any budget caps you want to use. You may submit additional scenario requests in the same file."
},
{
"template_name":"compliance testing",
"question":"21. Did the client provide excluded compensation for the Profit Sharing or Nonelective calculation?",
"yes_text":"Excluded compensation was provided.",
"no_text":"Excluded compensation must be provided.",
"not_applicable_text":"Excluded compensation is not allowed in this plan.",
"category":"PROFITSHARING",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"If the client failed to provide excluded compensation, add to your questions to client: I understand that you intend to fund a Profit Sharing or Nonelective contribution this year. Your document states that certain compensation (list the types here) should be excluded from this calculation, as long as the tests determine that its exclusion is nondiscriminatory. Please update your census to show this excluded compensation."
},
{
"template_name":"compliance testing",
"question":"22. If the plan is cross-tested, that is, every individual is in their own class and is making a Profit Sharing/Nonelective contribution have you confirmed the formula calculations?",
"yes_text":"Profit Sharing/Nonelective calculations have been confirmed.",
"no_text":"Profit Sharing/Nonelective calculations must be confirmed.",
"not_applicable_text":"Profit Sharing/Nonelective Calculations do not apply because the source is not permitted or because no funding will be made this year.",
"category":"PROFITSHARING",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Confirm the formula calculations within the Eligibility Proof. Account for any K-1/Schedule C adjustments to income and for contributions as a percent of ownership and show any classes used in the calculation. Show that the formula matches the reports or adjust either the system or spreadsheet as appropriate."
},
{
"template_name":"compliance testing",
"question":"23. Have you prepared the Profit Sharing/Nonelective Contribution file for either the contribution/calculation or excesses?",
"yes_text":"Profit Sharing/nonelective contribution file prepared.",
"no_text":"Profit Sharing/nonelective contribution file must be prepared.",
"not_applicable_text":"No Profit Sharing/Nonelective file is required as the source does not exist or there will be no funding this year.",
"category":"PROFITSHARING",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Prepare the file showing either the entire contribution due, as well as the percentage of compensation being contributed and the relevant data needed by operations to load the file (social security number, dates, name and source and contribution amount)."
},
{"template_name":"compliance testing",
"question":"24. Have you confirmed that HCEs by Attribution are identified in the file?",
"yes_text":"Owner family members and persons with same last name as owners have relationship to owners identified.",
"no_text":"Identify owner family members and relationship to owners of people with the same last name.",
"not_applicable_text":"No owners in the plan.",
"category":"ATTRIBUTION",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"If the attribution was not confirmed by the current questionnaire then state that in the Assumptions used. Sample text: I used last year’s information to determine owners by attribution because no updated information was provided for this year. If any owners by attribution are no longer owners by attribution, please let me know so that I can recalculate and reprint the reports."
},
{
"template_name":"compliance testing",
"question":"25. Did you load the participant source activity?",
"yes_text":"Participant contribution by source loaded.",
"no_text":"Participant contribution by source must be loaded.",
"not_applicable_text":"There is no participant contribution activity to load.",
"category":"ACTIVITYLOAD",
"primary_driver": false,
"resource_url":"https://www.youtube.com",
"help_text":"Obtain the participant source activity and format it as needed from the recordkeeping system reports portal/interface."
},
{
"template_name":"compliance testing",
"question":"26. Have you printed the Top Heavy Test for next testing year and the current allocation if the plan is not a 100% Union or 403(b) plan and one of the following situations apply: The plan is receiving (1) Deferrals only, (2) Deferrals and Match only or (3) Deferrals and a Safe Harbor contribution and is making Profit Sharing/Nonelective contributions?",
"yes_text":"Top Heavy Allocation & Test Printed.",
"no_text":"Print Top Heavy Allocation & Test.",
"not_applicable_text":"Top Heavy Allocation & Test do not apply.",
"category":"TOPHEAVYTEST",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"To properly perform a Top Heavy Test make sure that the plan’s owners are correctly identified including percent of ownership in all cases. For the Top Heavy test you must also confirm that the officers are correctly coded in the system. If no officers are listed AND there are individuals making over $150,000 as indexed AND these individuals are not already classified as owners, add a question to client: Please confirm the following persons are not officers:"
},
{
"template_name":"compliance testing",
"question":"27. Did you load vesting?",
"yes_text":"Vesting loaded.",
"no_text":"Load vesting.",
"not_applicable_text":"Vesting load does not apply.",
"category":"VESTINGLOAD",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Obtain the vesting report from the recordkeeping system reports portal/interface, format it as needed and load it."
},
{
"template_name":"compliance testing",
"question":"28. Did you confirm census contributions against the trust and provide a true-up file for any variances?",
"yes_text":"Trust accounting complete.",
"no_text":"Complete trust accounting.",
"not_applicable_text":"Trust accounting does not apply.",
"category":"TRUEUP",
"primary_driver": false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"29. Has the client responded to all questions?",
"yes_text":"Client has responded to all questions.",
"no_text":"Follow-up with client on questions.",
"not_applicable_text":"Client questions do not apply.",
"category":"CLIENTRESPONSES",
"primary_driver":true,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"30. Have all the client responses been entered?",
"yes_text":"Client responses all entered.",
"no_text":"Enter client responses.",
"not_applicable_text":"Client responses not applicable.",
"category":"CLIENTRESPONSES",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"31. Have you regenerated the reports and re-confirmed the numbers?",
"yes_text":"Reports reprinted and re-reconciled.",
"no_text":"Reprint reports and re-reconcile.",
"not_applicable_text":"Reprinting reports and re-reconciling not applicable.",
"category":"REGENERATE",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"32. Did you print the Title Page?",
"yes_text":"Title page printed.",
"no_text":"Print title page.",
"not_applicable_text":"Title page is not applicable.",
"category":"TITLEPAGE",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"33. Did you print the Table of Contents?",
"yes_text":"Table of contents printed.",
"no_text":"Print table of contents.",
"not_applicable_text":"Table of contents not applicable.",
"category":"TABLEOFCONTENTS",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"34. Did you print the Results Summary?",
"yes_text":"Results summary printed.",
"no_text":"Print results summary.",
"not_applicable_text":"Results summary not applicable.",
"category":"RESULTS",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"35. Did you print the ADP and ACP Nondiscrimination Test or ADP Nondiscrimination Test, as applies?",
"yes_text":"ADP/ACP report printed.",
"no_text":"Print ADP/ACP report.",
"not_applicable_text":"ADP/ACP report not applicable.",
"category":"ADPACP",
"primary_driver": false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"36. Did you print the Catch-Up Contributions Summary?",
"yes_text":"Catch-Up contribution report printed.",
"no_text":"Print Catch-up contribution report.",
"not_applicable_text":"Catch-up contribution report does not apply.",
"category":"ADPACP",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"https://www.youtube.com",
}
{
"template_name":"compliance testing",
"question":"37. Did you print the Annual Additions Test?",
"yes_text":"Annual Additions report printed.",
"no_text":"Print Annual Additions report.",
"not_applicable_text":"Annual Additions report not applicable.",
"category":"ANNUALADDITIONS",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"38. Did you print the General Test under 401(a)(4)?",
"yes_text":"General Test printed.",
"no_text":"Print General Test.",
"not_applicable_text":"General test does not apply.",
"category":"PROFITSHARING",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"39. Did you print the Budget Report for Sole Proprietorships/Partnerships with Schedule C or K income?",
"yes_text":"Budget printed.",
"no_text":"Print Budget.",
"not_applicable_text":"Budget does not apply.",
"category":"K1",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"40. Did you print the 414(s) test if excluded compensation other than 125, reimbursements or date of participation compensation was used?",
"yes_text":"414(s) printed.",
"no_text":"414(s) not printed.",
"not_applicable_text":"414(s) does not apply.",
"category":"414S",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"41. Did you place a copy of the census in the working papers folder, all review files in the Review Folder and all Client Files including reports and contribution and refund files in the Client Folder?",
"yes_text":"Files saved to folders.",
"no_text":"Save files to folders.",
"not_applicable_text":"Saving files to folders does not apply.",
"category":"FILES",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"42. Did you enter the contributions for deferrals and roth for the three relevant periods as necessary if the plan is an Off-Calendar (fiscal year end) plan?",
"yes_text":"Off-calendar 402(g) numbers entered.",
"no_text":"Enter off-calendar 402(g) numbers.",
"not_applicable_text":"402(g) numbers do not apply.",
"category":"OFFCALENDAR",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"43. Did you update vesting to 100% if the plan terminated and has a signed termination agreement and did you adjust the testing compensation by the ratio of months in the plan year based on the year end date?",
"yes_text":"Plan Termination vesting updated.",
"no_text":"Update vesting for plan termination.",
"not_applicable_text":"Plan is not terminating - vesting update to 100% not applicable.",
"category":"PLANTERMINATION",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"44. For plans with Short Plan Years did you adjust the testing compensation, the deferral limits and any required hours for testing?",
"yes_text":"Short Plan Year compensation, deferral limits and hours adjustments made.",
"no_text":"Make adjustments to compensation limit, deferral limit and hours for short plan year.",
"not_applicable_text":"Short plan year adjustments not applicable.",
"category":"SHORTPLANYEAR",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"45. Has the relevant tracking database been updated?",
"yes_text":"Tracking database updated.",
"no_text":"Update tracking database.",
"not_applicable_text":"Tracking database update not applicable.",
"category":"TRACKING",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"46. If the plan had late deferrals, have you logged a request to prepare a submission in the relevant tracking database?",
"yes_text":"Late deferrals tracking record created.",
"no_text":"Log a late deferrals tracking record.",
"not_applicable_text":"A late deferrals tracking record is not needed.",
"category":"LATEDEFERRALS",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
{
"template_name":"compliance testing",
"question":"47. Have you logged a request to begin preparation of the 5500, Summary Annual Report and 8955-SSA in the relevant tracking database?",
"yes_text":"Government Forms Tracking created.",
"no_text":"Add Government Forms tracking.",
"not_applicable_text":"Government Forms tracking is not needed for this plan.",
"category":"GOVERNMENTFORMS",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":""
},
// second test checklist
{
"template_name":"client compliance guide",
"question":"Is your file organized with the same top row as the initial file downloaded?",
"yes_text":"Headers fine.",
"no_text":"Fix headers.",
"not_applicable_text":"We assumed headers don't apply to your file. It is a custom file. This will likely slow down processing because the file will need to be manually formatted instead fo automatically processed.",
"category":"HEADERS",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Not providing a file which is correctly arranged can result in delays and errors in your testing."
}
{
"template_name":"client compliance guide",
"question":"Apply a filter across the rows in the original template. When you filter social security numbers are there any blanks?",
"yes_text":"Social Security Numbers fine.",
"no_text":"Fix social security numbers.",
"not_applicable_text":"You answered N/A. We can use employee ID numbers to load a file when social security numbers are not available. All employees must have employee IDs in order to link their information from year to year and avoid confusion when employees have similar names.",
"category":"SSN",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Social security numbers or another unique identifier such as an employee id are needed to match data for employees from year to year. You can transmit your files securely."
}
{
"template_name":"client compliance guide",
"question":"When you filter dates of birth are there any blanks?",
"yes_text":"Dates of Birth Fine.",
"no_text":"Fix Dates of Birth.",
"not_applicable_text":"Warning! All files should have dates of birth.",
"category":"BIRTH",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Dates of birth are used to determine eligibility and entry for a plan. Unless the plan has no age requirement and is a Safe Harbor or has no HCE contributions it is expected that these will be provided so that test results can be accurately calculated."
}
{
"template_name":"client compliance guide",
"question":"When you filter dates of birth are there any for persons under 18?",
"yes_text":"Dates of birth for young employees are correct.",
"no_text":"Fix dates of birth for employees that make them younger than they are.",
"not_applicable_text":"No employees are under 18.",
"category":"BIRTH",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Sometimes persons under 18, expecially owners children may be hired as teenagers and flagged in the system for extra scrutiny. Other times they may be indicators of a typing error."
}
{
"template_name":"client compliance guide",
"question":"When you filter dates of birth are there any for persons over 80 who should not be?",
"yes_text":"Retiree dates of hire fine.",
"no_text":"Fix dates of birth for retiree hires.",
"not_applicable_text":"There are no retiree age hires.",
"category":"BIRTH",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Some testing systems will flag anyone over retirement age for review. Please ensure these persons birthdates are correct."
}
{
"template_name":"client compliance guide",
"question":"When you filter dates of hire are there any blanks?",
"yes_text":"Dates of Hire fine.",
"no_text":"Fix dates of hire.",
"not_applicable_text":"All employees must have a valid date of hire. Correct the file and change your answer to Y.",
"category":"HIRE",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"All employees must have a valid date of hire so that we can accurately calculate their eligibility for the plan and entry date, as well as the vesting of their contributions. After testing is complete, the next step in annual administration is government forms filing, which includes the tracking and reporting of the numbers of persons with balances not 100% vested using the Form 8955-A." }
{
"template_name":"client compliance guide",
"question":"Are there any blank dates of rehire for persons who have a termination date prior to this year and received compensation?",
"yes_text":"Dates of Rehire fine.",
"no_text":"Fix dates of rehire.",
"not_applicable_text":"Dates of rehire did not apply.",
"category":"REHIRE",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Inaccurate dates of rehire can make someone drop from the tests, causing results to be inaccurate. When the ADP test is inaccurate and discovered after the refund deadline, penalties may apply."
}
{
"template_name":"client compliance guide",
"question":"Are there any termination dates for people before rehire dates?",
"yes_text":"Dates of rehire after termination fine.",
"no_text":"Fix dates of rehire.",
"not_applicable_text":"There are no dates of rehire to correct.",
"category":"REHIRETERM",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Termination dates after rehire dates may cause someone to drop from the tests in error."
}
{
"template_name":"client compliance guide",
"question":"When you apply a filter do you have percentages in the ownership column that add up to 100% or is not have you explained on tab 2?",
"yes_text":"Owners identified.",
"no_text":"Enter owner percentages onto the file.",
"not_applicable_text":"If there are no owners, note on tab 2.",
"category":"OWNERSHIP",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"All ownership nmust be accounted for or teh tests may be inaccurate and a plan may fail the ADP test but the discovery may be too late to correct the test without causing penalties for late compliance. There are some circumstances where a plan may truly have outside non-employee ownership, which causes the ownership percentages to be less than 100%, but this tends to be rare."
}
{
"template_name":"client compliance guide",
"question":"Have you placed a Y in the officer column for each officer or explained on tab 2 that there are no officers?",
"yes_text":"Officers have been marked in the file.",
"no_text":"Mark officers.",
"not_applicable_text":"No officers are employees.",
"category":"OFFICERS",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Officers must be identified so that the top heavy test and allocation can be performed accurately. If a plan has no persons earning over $150,000 as indexed there will be no officers of concern for the test. Of, however, the plan does have officers earning over $150,000, not flagging them could cause a test's failure to be discovered later, with consequences for the plan."
}
{
"template_name":"client compliance guide",
"question":"Have you indicated the relationship of all family members for anyone who has a relationship to the owner(s)?",
"yes_text":"Family attribution has been noted in the file, including for persons with the same last names as the owners.",
"no_text":"Fix family attribution including noting relationship of persons with the same last name as the owners.",
"not_applicable_text":"There is no ownership in this plan or persons with the same last name as the owners.",
"category":"ATTRIBUTION",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"If family attribution is not correctly identified, the HCEs may be improperly determined and a plan might pass a test it should be shown as failing with penalties if the correction is late. One of the most common attribution errors is attributing ownership to siblings (borthers or sisters). While there is no attribution between siblings it is good to notate these relationships to prevent delays in processing while waiting for clarification of these relationships."
}
{
"template_name":"client compliance guide",
"question":"Have you entered a formula for the Match or entered no match on tab 2?",
"yes_text":"Match contributions clarified - either none or for yes, formula and principal class numbers and budget provided.",
"no_text":"Provide match answer and formula if funding.",
"not_applicable_text": "Match does not apply.",
"category":"MATCH",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Your plan document will indicate whether or not the plan has a match source. If it does and the match is fixed, you are good to go. If it does not mark n/a. If it does have a match but the formula is discretionary, generally in the absence of guidance, you will be provided a match with the prior year's formula if you did not specify the formula, given the volume of plans processed."
}
{
"template_name":"client compliance guide",
"question":"Have you entered a formula for Profit Sharing including the class of each person based on how much Profit Sharing they should receive if eligible in the Principal column?",
"yes_text":"Profit sharing/nonelective contributions clarified - either none or for yes, formula and principal class numbers and budget provided.",
"no_text":"Provide Profit Sharing formula, and if, each class is its own separate group in the plan document(adoption agreement), add a principal code column to your spreadsheet and enter the group number to use for each eligible individual. On tab 2 identify the target percentage or dollar amount for each group or the plan as a whole.",
"not_applicable_text":"Profit Sharing or nonelective contributions will not be made for this testing year.",
"category":"PROFITSHARING",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Your plan document will indicate whether or not the plan has a profit sharing or nonelective source. If it does and the profit sharing is fixed, you are good to go. If it does not mark n/a. If it does have a profit sharing/nonelective source but the formula is discretionary, generally in the absence of guidance, you will be provided with a contribution calculation with the prior year's formula(s) if you did not specify the formula(s), given the volume of plans processed."
}
{
"template_name":"client compliance guide",
"question":"Excluded Compensation must be excluded in the plan document to be disregarded in calculating the Match/Profit Sharing. Have you confirmed that you did not enter the same amount as the compensation for participants not yet eligible to participate in the plan?",
"yes_text":"Excluded compensation provided.",
"no_text":"Provide excluded compensation.",
"not_applicable_text":"No excluded compensation is permitted in the plan document(adoption agreement) or the plan can use excluded compensation but chooses not to and is passing all tests and not funding any employer contributions such as a match or profit sharing or nonelective contribution, whether regular or Safe Harbor.",
"category":"EXCLUDEDCOMPENSATION",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"A plan may be tested without excluding compensation that is listed in the plan document as excluded from a source or sources. If it passes, all is well. If, however, it fails, the plan may be tested with excluded compensation to see if it passes. So providing excluded compensation can be useful. Note that a plan's contributions may also have to be calculated using excluded compensation. Depending on the type of excluded compensation, (compensation that is not date of participation compensation or cafeteria plan contributions, for example) an additional test, the 414(s) compensation test may have to be run to confirm that the compensation can be excluded from calculating the contribution per IRS non-discrimination guidelines."
}
{
"template_name":"client compliance guide",
"question":"Excluded Employees must be excluded in the plan document to be disregarded in testing. Have you marked all these employees with a Y?",
"yes_text":"Excluded employees marked - fine.",
"no_text":"Mark excluded employees.",
"not_applicable_text":"There were no excluded employees.",
"category":"EXCLUDEDEMPLOYEES",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Employees may be excluded by class, which may help plans pass testing. Note that special rules apply to part-time and union employee exclusions, among others."
}
{
"template_name":"client compliance guide",
"question":"If your plan transferred to us in the middle of the plan year, did you provide the prior testing results?",
"yes_text":"Prior testing results provided.",
"no_text":"Prior testing results need to be provided.",
"not_applicable_text":"Prior testing results do not need to be provided because the plan was tested at the current provider last year or the plan's first testing year is this year.",
"category":"TAKEOVERPLAN",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Providing prior year testing helps quickly establish if ineligible employees are actually eligible, helps fill in data missing from the census without back and forth, and provides a cross-check aganst the current testing year's results and contribution funding. These results should always be provided as soon as possible."
}
{
"template_name":"client compliance guide",
"question":"If your plan transferred to us in the middle of the plan year, did you provide the prior custodians statement of contributions by participant by money type(source)?",
"yes_text":"Prior contribution data was provided.",
"no_text":"Provide prior contribution information.",
"not_applicable_text":"All activity for the testing year was conducted at the same provider. There were no conversions from another provider or outside accounts.",
"category":"TAKEOVERPLAN",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Providing prior provider contribution data quickly allows us to identify any contribution errors as soon as possible, minimizing the cost of late funding penalties."
}
{
"template_name":"client compliance guide",
"question":"If your entity is a Sole Proprietorship or Partnership have you entered Schedule C or Schedule K income on the spreadsheet and provided draft or actual Schedules?",
"yes_text":"Schedule C or K income entered comepletely on file and draft or final schedules provided.",
"no_text":"Provide Schedule C or K income and draft or final schedules.",
"not_applicable_text":"The plan is not a sole proprietorship or a partnership. Therefore Schedule C or K income does not have to be provided.",
"category":"K1",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Sole proprietorships and parnerships that are not receiving pass-through W-2 income must have their income reduced for FICA and contributions to employees in calculating contributions."
}
{
"template_name":"client compliance guide",
"question":"Have you identified any Schedule K recipients who are actually receiving income as W-2 income?",
"yes_text":"Schedule K participants receiving such income as W-2 income identified.",
"no_text":"Identify Schedule K participants receiving income as W-2 and place W-2 amount on census.",
"not_applicable_text":"Schedule K passing through as W-2 income not applicable.",
"category":"K1",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Occasionally sole proprietorships and partnerships or individual members thereof receive their income as pass-through W-2 income. Specifiying if this applies to the plan, who to and ensuring that the appropriate participation agreements or amendments are in place up front will reduce the need to re-calculate tests and contributions."
}
{
"template_name":"client compliance guide",
"question":"Are all participation agreements in place for all participating employers, especially if the sponsor is a partnership or sole proprietorship?",
"yes_text":"Participation agreements in place for all participating employers.",
"no_text":"Provide participating agreements or remove money contributed by non-participating employers. Seek advice of consulting.",
"not_applicable_text":"Participation Agreements not applicable.",
"category":"PARTICIPATIONAGREEMENTS",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"Having all participation agreements in place or amendents drafted and adopted timely will reduce time and effort re-calculating tests and contributions. Partnerships and certain industries such as medical and investment companies, as well as law offices should ensure that they have correctly provided these documents."
}
{
"template_name":"client compliance guide",
"question":"Has all the income for employees been accounted for or have you explained who has not on tab 2?",
"yes_text":"All income provided. Matches W-3.",
"no_text":"Add all employees' information so that gross compensation matches W-3.",
"not_applicable_text":"Please anwer yes or no as to whether all income was provided. The answer cannot be not applicable.",
"category":"ALLINCOME",
"primary_driver":false,
"resource_url":"https://www.youtube.com",
"help_text":"If there is missing income, it may affect the testing results and contribution calculations. Using a cross-check against the W-3 also ensures that no potentially eligible participants have been dropped, decreasing the chance of having persons with missed deferral opportunities that need to be funded by the plan sponsor."
}
]