[
	{
		"template_id":1,
		"question_number":1,
		"question":"1. Has the census been received?",
		"yes_text":"Census received",
		"no_text":"Census missing. Plan is/will be placed on hold.",
		"not_applicable_text":"A census must be provided. Not applicable is not an appropriate response.",
		"category":"CENSUS",
		"primary_driver":false,
		"resource_url":"https://www.youtube.com",
		"help_text":"If the census is missing, e-mail the relationship manager immediately prepare the folders and pull any reporting such as trust statements and start the trust reconciliation. Once you have gotten as far as possible, place the plan on hold."
	},
	{
		"template_id":1,
		"question_number":2,
		"question":"2. Has the questionnaire been received?",
		"yes_text":"Questionnaire received.",
		"no_text":"Questionnaire not received. Request. If the client appears to answer the same way each year move forward and ask the client to send a Questionnaire, confirm results.",
		"not_applicable_text":"A Questionnaire should be provided. If the client appears to answer the same way each year move forward and ask the client to send a Questionnaire, confirm results.",
		"category":"QUESTIONNAIRE",
		"primary_driver":false,
		"resource_url":"https://www.youtube.com",
		"help_text":"If the questionnaire is missing, prepare as much of the testing as possible based on assumptions inherited from the prior year, using either the system. E-mail the relationship manager: I am proceeding based on last year's questionnaire. That said I cannot release the results until I have received the questionnaire for the current year."
	},
	{
		"template_id":1,
		"question_number":3,
		"question":"3. Is the census formatted in a format that can be directly loaded into the system?",
		"yes_text":"Census is in a format ready for load.",
		"no_text":"Census must be formatted before it can be loaded.",
		"not_applicable_text":"An invalid response for whether the census was formatted correctly was entered. Choose either Y or N.",
		"category":"CENSUS",
		"primary_driver":false,
		"resource_url":"https://www.youtube.com",
		"help_text":"If the census has critical errors that prevent you from loading it into the system, let the relationship manager know. Some sample language: The census does not have social security numbers. The census is missing compensation for some employees. The census is missing compensation for all employees. The census is missing hours for some employees and the plan requires hours to calculate eligibility/allocate a contribution."
	},
	{
		"template_id":1,
		"question_number":4,
		"question":"4. Has the census been loaded to the system?",
		"yes_text":"Census loaded.",
		"no_text":"Census needs to be loaded.",
		"not_applicable_text":"An invalid response for whether the census was loaded was entered.  Choose either Y or N.",
		"category":"CENSUS",
		"primary_driver":false,
		"resource_url":"https://www.youtube.com",
		"help_text":"Make sure to load the census into the system and perform all necessary data checks within the system and forward all questions to the relationship manager. Review against the Eligibility Proof."
	},
	{
		"template_id":1,
		"question_number":5,
		"question":"5. Has an Eligibility proof been prepared from the census that separates employees into the categories HCEs, NHCEs, Ineligibles(with explanation such as age,service), Excluded, Prior Year Terms?",
		"yes_text":"Eligibility Proof employee classifications have been made.",
		"no_text":"Eligibility Proof employee classifications need to be made.",
		"not_applicable_text":"An invalid response for the Eligibility Proof employee classification step was entered. Choose either Y or N.",
		"category":"ELIGIBILITYPROOF",
		"primary_driver":false,
		"resource_url":"https://www.youtube.com",
		"help_text":"Use the template for the eligibility proof to estimate the test results. Formulas are included in the proof."
	},
	{
		"template_id":2,
		"question_number":1,
		"question":"1. Is your file organized with the same top row as the initial file downloaded?",
		"yes_text":"Headers fine.",
		"no_text":"Fix headers.",
		"not_applicable_text":"We assumed headers don't apply to your file. It is a custom file. This will likely slow down processing because the file will need to be manually formatted instead fo automatically processed.",
		"category":"HEADERS",
		"primary_driver":false,
		"resource_url":"https://www.youtube.com",
		"help_text":"Not providing a file which is correctly arranged can result in delays and errors in your testing."
	},
	{
		"template_id":2,
		"question_number":2,
		"question":"2. Apply a filter across the rows in the original template. When you filter social security numbers are there any blanks?",
		"yes_text":"Social Security Numbers fine.",
		"no_text":"Fix social security numbers.",
		"not_applicable_text":"You answered N/A. We can use employee ID numbers to load a file when social security numbers are not available. All employees must have employee IDs in order to link their information from year to year and avoid confusion when employees have similar names.",
		"category":"SSN",
		"primary_driver":false,
		"resource_url":"https://www.youtube.com",
		"help_text":"Social security numbers or another unique identifier such as an employee id are needed to match data for employees from year to year. You can transmit your files securely."
	},
	{
		"template_id":2,
		"question_number":3,
		"question":"3. When you filter dates of birth are there any blanks?",
		"yes_text":"Dates of Birth Fine.",
		"no_text":"Fix Dates of Birth.",
		"not_applicable_text":"Warning! All files should have dates of birth.",
		"category":"BIRTH",
		"primary_driver":false,
		"resource_url":"https://www.youtube.com",
		"help_text":"Dates of birth are used to determine eligibility and entry for a plan. Unless the plan has no age requirement and is a Safe Harbor or has no HCE contributions it is expected that these will be provided so that test results can be accurately calculated."
	},
	{
		"template_id":2,
		"question_number":4,
		"question":"4. When you filter dates of birth are there any for persons under 18?",
		"yes_text":"Dates of birth for young employees are correct.",
		"no_text":"Fix dates of birth for employees that make them younger than they are.",
		"not_applicable_text":"No employees are under 18.",
		"category":"BIRTH",
		"primary_driver":false,
		"resource_url":"https://www.youtube.com",
		"help_text":"Sometimes persons under 18, expecially owners children may be hired as teenagers and flagged in the system for extra scrutiny. Other times they may be indicators of a typing error."
	},
	{
		"template_id":2,
		"question_number":5,
		"question":"5. When you filter dates of birth are there any for persons over 80 who should not be?",
		"yes_text":"Retiree dates of hire fine.",
		"no_text":"Fix dates of birth for retiree hires.",
		"not_applicable_text":"There are no retiree age hires.",
		"category":"BIRTH",
		"primary_driver":false,
		"resource_url":"https://www.youtube.com",
		"help_text":"Some testing systems will flag anyone over retirement age for review. Please ensure these persons birthdates are correct."
	}
]